# Pandas

### Numpy and pandas are backbone for EDA
### Pandas is an open source, providing high performance, easy to use data structures and data analysis tools for the python programming

### Data frames
#### Data Frame, rows and cols representation ( after loading csv,excel file )

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame([1,2,3])  # creating data frame

In [3]:
df

   0
0  1
1  2
2  3

In [4]:
df=pd.DataFrame(np.arange(0,20).reshape(4,5),index=["Row1","Row2","Row3","Row4"],columns=["col1","col2","col3","col4","col5"])

In [5]:
df

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9
Row3    10    11    12    13    14
Row4    15    16    17    18    19

In [6]:
df.head()  # returns top 5 records

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9
Row3    10    11    12    13    14
Row4    15    16    17    18    19

In [7]:
df.to_csv("test_csv_file")   # save df as csv file

In [8]:
df1=pd.read_csv("test_csv_file")  # reading csv file to DF

# df2=pd.read_csv("test.csv",sep=';') # in the csv file, replace comma with semicolon and ,mention seperator in the function

In [9]:
df

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9
Row3    10    11    12    13    14
Row4    15    16    17    18    19

### Accessing elements
### 2 ways to access (.loc and .iloc)

In [10]:
df.loc['Row1']   # same way col1 will not work

col1    0
col2    1
col3    2
col4    3
col5    4
Name: Row1, dtype: int64

In [11]:
type(df.loc['Row1'])  # Data series

pandas.core.series.Series

In [12]:
df.loc['Row1':'Row3']

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9
Row3    10    11    12    13    14

In [13]:
# Data frame is combination of many rows and many cols- atleast it should be > 1 row and 1 Col

# Data series- either one row or one col

In [14]:
df.iloc[:,:]   # same as numpy it works [row info, col info]  # important # iloc works with index

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9
Row3    10    11    12    13    14
Row4    15    16    17    18    19

In [15]:
df.iloc[0:2,:]

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9

In [16]:
df.iloc[:,0]  #data series

Row1     0
Row2     5
Row3    10
Row4    15
Name: col1, dtype: int64

In [17]:
df.iloc[0,:] #data series

col1    0
col2    1
col3    2
col4    3
col5    4
Name: Row1, dtype: int64

In [18]:
type(df.iloc[:,0])

pandas.core.series.Series

In [19]:
# convert Dataframe in array
# while converting it will skip the row index and col index

df.iloc[0:3,0:3].values

array([[ 0,  1,  2],
       [ 5,  6,  7],
       [10, 11, 12]])

In [20]:
df.iloc[0:3,0:3].values.shape

(3, 3)

In [21]:
df

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9
Row3    10    11    12    13    14
Row4    15    16    17    18    19

In [22]:
df['col1'].value_counts()   #important

15    1
5     1
10    1
0     1
Name: col1, dtype: int64

In [23]:
df['col2'].unique()

array([ 1,  6, 11, 16])

In [24]:
df.isnull().sum()   # how to check the null condition  #important

col1    0
col2    0
col3    0
col4    0
col5    0
dtype: int64

In [25]:
df['col2']

Row1     1
Row2     6
Row3    11
Row4    16
Name: col2, dtype: int64

In [26]:
type(df['col2'])  # Data series

pandas.core.series.Series

In [27]:
df[['col2','col3']]  # multiple cols display

      col2  col3
Row1     1     2
Row2     6     7
Row3    11    12
Row4    16    17

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Row1 to Row4
Data columns (total 5 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null int64
col4    4 non-null int64
col5    4 non-null int64
dtypes: int64(5)
memory usage: 352.0+ bytes

In [29]:
df.describe()   # while using describe() only integer and floating values are taken into consideration # categorial values skipped

            col1       col2       col3       col4       col5
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [30]:
df

      col1  col2  col3  col4  col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9
Row3    10    11    12    13    14
Row4    15    16    17    18    19

In [31]:
df[df['col2']>8]

      col1  col2  col3  col4  col5
Row3    10    11    12    13    14
Row4    15    16    17    18    19

## CSV

In [32]:
from io import StringIO, BytesIO

In [33]:
data=('col1,col2,col3\n'
        'x,y,z\n'
         'a,b,c')

In [34]:
type(data)

str

In [35]:
pd.read_csv(StringIO(data))

  col1 col2 col3
0    x    y    z
1    a    b    c

In [36]:
# Read only specific columns 

df2=pd.read_csv(StringIO(data),usecols=['col1','col2'])

In [37]:
df2

  col1 col2
0    x    y
1    a    b

In [38]:
print(data)

col1,col2,col3
x,y,z
a,b,c

In [39]:
data=('col1,col2,col3\n'
        '1,2,3\n'
         '4,5,6\n'
          '7,8')

In [40]:
# object in dataframe means string

In [41]:
df3=pd.read_csv(StringIO(data),dtype=object)   #int ,float

In [42]:
df3

  col1 col2 col3
0    1    2    3
1    4    5    6
2    7    8  NaN

In [43]:
df3['col1'][1]

'4'

In [44]:
df3['col2']

0    2
1    5
2    8
Name: col2, dtype: object

In [45]:
df3=pd.read_csv(StringIO(data),dtype=int)  #

ValueError: Integer column has NA values in column 2

In [46]:
data=('col1,col2,col3\n'
        '1,2,3\n'
         '4,5,6\n'
          '7,8,9')    # added missed value

In [47]:
df3=pd.read_csv(StringIO(data),dtype=int)

In [48]:
df3   # worked now

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [49]:
df3['col1']

0    1
1    4
2    7
Name: col1, dtype: int64

In [50]:
df4=pd.read_csv(StringIO(data),dtype={'col1':int,'col2':float,'col3':'Int64'})    #np.float

In [51]:
df4

   col1  col2  col3
0     1   2.0     3
1     4   5.0     6
2     7   8.0     9

In [52]:
df4['col1']

0    1
1    4
2    7
Name: col1, dtype: int64

In [53]:
type(df4['col1'][0])

numpy.int64

In [54]:
df4.dtypes

col1      int64
col2    float64
col3      Int64
dtype: object

In [55]:
print(data)

col1,col2,col3
1,2,3
4,5,6
7,8,9

In [56]:
df4

   col1  col2  col3
0     1   2.0     3
1     4   5.0     6
2     7   8.0     9

In [57]:
df4=pd.read_csv(StringIO(data),index_col=0)   # making Col1 as index column

In [58]:
df4

      col2  col3
col1
1        2     3
4        5     6
7        8     9

In [59]:
df4=pd.read_csv(StringIO(data),index_col=1) # making col2 as index column

In [60]:
df4

      col1  col3
col2
2        1     3
5        4     6
8        7     9

In [61]:
data=('a,b,c\n'
        '4,apple,bat\n'
         '8,orange,cow')

In [62]:
pd.read_csv(StringIO(data))

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [63]:
data=('a,b,c\n'
        '4,apple,bat,\n'
         '8,orange,cow,')   # if  comma is not used at end of line it works fine

In [64]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [65]:
pd.read_csv(StringIO(data),index_col=False)  # to work in this case using index_col= False

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [66]:
## URL to csv

x=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep="\t")  # URL has CSV file with '\t' seperated values

In [67]:
x.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,399
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,374
4,SA0L1,All items less food,1,T,358